In [1]:
# dependencies
import pandas as pd
import csv
import numpy as np

In [2]:
# Import csv's in Dataframes
departments_df = pd.read_csv("departments.csv")
dept_emp_df = pd.read_csv("dept_emp.csv")
dept_manager_df = pd.read_csv("dept_manager.csv")
employees_df = pd.read_csv("employees.csv")
salaries_df = pd.read_csv("salaries.csv")
titles_df = pd.read_csv("titles.csv")

### Departments Table
- All values unique

In [3]:
display(departments_df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   dept_no    9 non-null      object
 1   dept_name  9 non-null      object
dtypes: object(2)
memory usage: 276.0+ bytes

None

In [4]:
display(departments_df.value_counts())

dept_no  dept_name
d001     Marketing             1
d002     Finance               1
d003     Human Resources       1
d004     Production            1
d005     Development           1
d006     Quality Management    1
d007     Sales                 1
d008     Research              1
d009     Customer Service      1
Name: count, dtype: int64

### Department Employees Table
- Some Employees are classified under two departments

In [5]:
display(dept_emp_df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 331603 entries, 0 to 331602
Data columns (total 2 columns):
 #   Column   Non-Null Count   Dtype
---  ------   --------------   -----
 0   emp_no   331603 non-null  int64
 1   dept_no  331603 non-null  object
dtypes: int64(1), object(1)
memory usage: 5.1+ MB

None

In [6]:
display(dept_emp_df.head(3))

   emp_no dept_no
0   10001    d005
1   10002    d007
2   10003    d004

In [7]:
display(dept_emp_df.nunique())

emp_no     300024
dept_no         9
dtype: int64

In [8]:
display(dept_emp_df["emp_no"].value_counts().head())

emp_no
223120    2
459963    2
54758     2
222487    2
459954    2
Name: count, dtype: int64

### Department Manager Table
- 9 departments
- 3 departments have 4 managers and the rest all have 2

In [9]:
display(dept_manager_df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 24 entries, 0 to 23
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   dept_no  24 non-null     object
 1   emp_no   24 non-null     int64
dtypes: int64(1), object(1)
memory usage: 516.0+ bytes

None

In [10]:
display(dept_manager_df.head(3))

  dept_no  emp_no
0    d001  110022
1    d001  110039
2    d002  110085

In [11]:
display(dept_manager_df['dept_no'].value_counts())

dept_no
d004    4
d006    4
d009    4
d001    2
d002    2
d003    2
d005    2
d007    2
d008    2
Name: count, dtype: int64

In [12]:
display(dept_manager_df.nunique())

dept_no     9
emp_no     24
dtype: int64

### Employees Table
- 300,024 unique employees

In [13]:
display(employees_df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300024 entries, 0 to 300023
Data columns (total 7 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   emp_no        300024 non-null  int64
 1   emp_title_id  300024 non-null  object
 2   birth_date    300024 non-null  object
 3   first_name    300024 non-null  object
 4   last_name     300024 non-null  object
 5   sex           300024 non-null  object
 6   hire_date     300024 non-null  object
dtypes: int64(1), object(6)
memory usage: 16.0+ MB

None

In [14]:
display(employees_df.sort_values(by="emp_no").head(3))

473302 in employees_df["emp_no"]

        emp_no emp_title_id birth_date first_name last_name sex   hire_date
200187   10001        e0003   9/2/1953     Georgi   Facello   M   6/26/1986
166677   10002        s0001   6/2/1964    Bezalel    Simmel   F  11/21/1985
73092    10003        e0003  12/3/1959      Parto   Bamford   M   8/28/1986

False

In [34]:
rosalie_id = employees_df["emp_no"][(employees_df["first_name"] == "Rosalie") & (employees_df["last_name"] == "Chinin")]
rosalie_id.info(verbose=True)
display("")
display(400001 in employees_df["emp_no"])
display(employees_df["emp_no"][(employees_df["emp_no"] == 400001)])
display("")
# display(rosalie_id[0] in employees_df["emp_no"])
# display("")
display(rosalie_id)
# display(rosalie_id.values)

<class 'pandas.core.series.Series'>
Index: 1 entries, 259346 to 259346
Series name: emp_no
Non-Null Count  Dtype
--------------  -----
1 non-null      int64
dtypes: int64(1)
memory usage: 16.0 bytes

''

False

259346    400001
Name: emp_no, dtype: int64

''

259346    400001
Name: emp_no, dtype: int64

In [16]:
display(employees_df['emp_title_id'].value_counts())

emp_title_id
s0001    107384
e0003     97747
e0002     47303
s0002     26583
e0004     15148
e0001      5835
m0001        24
Name: count, dtype: int64

In [17]:
display(employees_df["emp_no"].nunique())

300024

In [18]:
display(employees_df["emp_title_id"].nunique()) # 7 titles available to employees

7

### Salaries Table
- 300,024 unique ids -> the same total as in the employees table

In [19]:
display(salaries_df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300024 entries, 0 to 300023
Data columns (total 2 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   emp_no  300024 non-null  int64
 1   salary  300024 non-null  int64
dtypes: int64(2)
memory usage: 4.6 MB

None

In [20]:
display(salaries_df.head(3))

   emp_no  salary
0   10001   60117
1   10002   65828
2   10003   40006

In [21]:
display(salaries_df["emp_no"].nunique())

300024

### Titles Table

In [22]:
display(titles_df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   title_id  7 non-null      object
 1   title     7 non-null      object
dtypes: object(2)
memory usage: 244.0+ bytes

None

In [23]:
display(titles_df.value_counts())

title_id  title
e0001     Assistant Engineer    1
e0002     Engineer              1
e0003     Senior Engineer       1
e0004     Technique Leader      1
m0001     Manager               1
s0001     Staff                 1
s0002     Senior Staff          1
Name: count, dtype: int64

In [24]:
display(titles_df.head(3))

  title_id               title
0    s0001               Staff
1    s0002        Senior Staff
2    e0001  Assistant Engineer

In [25]:
# Do the employees have the same ids?

In [26]:
count = 0
for i in range(len(salaries_df["emp_no"])):
    if salaries_df["emp_no"][i] not in employees_df["emp_no"]:
        if count < 5:
            print(f'employee number: {salaries_df["emp_no"][i]} not found')
        count += 1
    # if count >4:
    #     break
print(count)

employee number: 400000 not found
employee number: 400001 not found
employee number: 400002 not found
employee number: 400003 not found
employee number: 400004 not found
100000

In [27]:
# There employee table employee numbers not in the salary table(why?)
count = 0
for i in range(len(employees_df["emp_no"])):
    if employees_df["emp_no"][i] not in salaries_df["emp_no"]:
        if count < 5:
            print(f'employee number: {employees_df["emp_no"][i]} not found')
        count += 1
    # if count >4:
    #     break
print(count)

employee number: 473302 not found
employee number: 475053 not found
employee number: 421786 not found
employee number: 461591 not found
employee number: 477657 not found
100000

In [28]:
employee_highid_df = employees_df[employees_df["emp_no"] > 399900]

emp_highid_sort_df = employee_highid_df.sort_values(by="emp_no", ascending=True)

display(emp_highid_sort_df.head(3))
display(emp_highid_sort_df.tail(3))

        emp_no emp_title_id  birth_date first_name last_name sex   hire_date
63123   400000        s0001  11/29/1963  Mitsuyuki  Reinhart   M   8/27/1985
259346  400001        s0001    6/2/1962    Rosalie    Chinin   M  11/28/1986
248230  400002        e0003   8/16/1964    Quingbo  Birnbaum   F   4/23/1986

        emp_no emp_title_id birth_date first_name last_name sex   hire_date
67702   499997        e0003   8/3/1961    Berhard    Lenart   M   4/21/1986
209152  499998        s0001   9/5/1956   Patricia   Breugel   M  10/13/1993
114041  499999        e0002   5/1/1958     Sachin   Tsukuda   M  11/30/1997

In [29]:
count = 0
for i in range(len(salaries_df["emp_no"])):
    if employees_df["emp_no"][i] not in salaries_df["emp_no"]:
        print(f'employee number: {employees_df["emp_no"][i]} not found')
        count += 1
    if count >4:
        break

employee number: 473302 not found
employee number: 475053 not found
employee number: 421786 not found
employee number: 461591 not found
employee number: 477657 not found

In [30]:
# check salaries and dept_emp
count = 0
for i in range(len(salaries_df["emp_no"])):
    if salaries_df["emp_no"][i] not in dept_emp_df["emp_no"]:
        if count < 5:
            print(f'employee number: {salaries_df["emp_no"][i]} not found')
        count += 1
    # if count >4:
    #     break
print(count)

employee number: 400000 not found
employee number: 400001 not found
employee number: 400002 not found
employee number: 400003 not found
employee number: 400004 not found
100000

In [31]:
count = 0
for i in range(len(employees_df["emp_no"])):
    if employees_df["emp_no"][i] not in salaries_df["emp_no"]:
        if count < 5:
            print(f'employee number: {employees_df["emp_no"][i]} not found')
        count += 1
    # if count >4:
    #     break
print(count)

employee number: 473302 not found
employee number: 475053 not found
employee number: 421786 not found
employee number: 461591 not found
employee number: 477657 not found
100000